{
  "backend/main.mo": "Motoko actor defining Product and CartItem types, storing 18 hardcoded products (clothing, accessories) in a Map, and providing query/update methods to get products, get cart, and add items to per-principal shopping carts.",
  "feature_evidence.json": "Feature evidence report documenting that ProductGrid.tsx was updated to add image URL mappings for newly added products (hoodies, shorts, sunglasses, caps, etc.) using the existing imageMap pattern.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of all frontend TypeScript/TSX files, describing their roles in the React application (components, contexts, hooks, and configuration).",
  "frontend/index.css": "Tailwind CSS base styles defining CSS custom properties for light and dark themes using OKLCH color space, with design tokens for background, foreground, borders, and semantic colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, \"HIZE\" title, a root div, and a module script loading main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping the app with CartProvider and rendering Navigation, Hero, ProductGrid, About, and Footer components in a full-height container.",
  "frontend/src/components/About.tsx": "About section component displaying \"The HIZE Philosophy\" story with campaign image, brand narrative text, and three value pillars (Sourcing, Ethics, Intent) in a responsive grid layout.",
  "frontend/src/components/Cart.tsx": "Sliding cart overlay component with backdrop, displaying cart items with product details and remove buttons, calculating total price, and providing a checkout button.",
  "frontend/src/components/Footer.tsx": "Footer component displaying HIZE logo, social/legal links, copyright notice, and Caffeine.ai attribution with dynamic UTM tracking based on hostname.",
  "frontend/src/components/Hero.tsx": "Hero section with 90vh height, background image, \"Summer Uniform '26\" heading, tagline, and \"Shop Collection\" button that smoothly scrolls to the shop section.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar with HIZE logo, navigation buttons (Shop, About, Journal) using smooth scroll, dynamic bag counter button, and Cart overlay integration.",
  "frontend/src/components/ProductCard.tsx": "Reusable product card component displaying product image (or placeholder), name, price, and \"Add to Bag\" button with loading state and hover effects.",
  "frontend/src/components/ProductGrid.tsx": "React component that displays a grid of products with images, fetches products from CartContext, and handles adding items to cart with loading states. Maps product names to image URLs (local assets and Unsplash).",
  "frontend/src/contexts/CartContext.tsx": "React context provider that manages cart state, product list, and cart visibility. Provides functions to add/remove items, refresh cart data, and interact with the backend actor.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance using React Query, handling both authenticated and anonymous actors. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Provides login, logout, and status tracking functionality.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for fetching products and cart items from the backend actor. Both queries are enabled only when the actor is available and not fetching.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space. Defines design tokens for colors, spacing, and animations with base styles for HTML and body.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the root DOM element.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, container queries, animations, and design tokens for the HIZE brand aesthetic.",
  "project_state.json": "Project metadata describing a minimalist e-commerce site for HIZE fashion brand with implemented features including shopping cart, hero section, product grid, about section, and navigation. Lists known issues like placeholder images and incomplete cart functionality."
}