{
  "kind": "build_request",
  "title": "Add hoodies, shorts, sunglasses, caps, and additional items to product catalog",
  "projectName": "HIZE",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Add new product entries to the backend products array in backend/main.mo for hoodies with realistic names, prices ($80-$150 range), and descriptions fitting the HIZE premium minimalist aesthetic",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add hoodies, shorts, sun glasses, caps and etc."
        ]
      },
      "acceptanceCriteria": [
        "At least 2 hoodie products added to the products array",
        "Each hoodie has a unique id, name, price, and description",
        "Prices reflect premium quality ($80-$150 range)",
        "Descriptions emphasize organic materials, minimalist design, and versatility"
      ]
    },
    {
      "id": "REQ-13",
      "text": "Add new product entries to the backend products array in backend/main.mo for shorts with realistic names, prices ($65-$95 range), and descriptions fitting the HIZE premium minimalist aesthetic",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add hoodies, shorts, sun glasses, caps and etc."
        ]
      },
      "acceptanceCriteria": [
        "At least 2 shorts products added to the products array",
        "Each shorts product has a unique id, name, price, and description",
        "Prices reflect premium quality ($65-$95 range)",
        "Descriptions emphasize comfort, breathability, and clean lines"
      ]
    },
    {
      "id": "REQ-14",
      "text": "Add new product entries to the backend products array in backend/main.mo for sunglasses with realistic names, prices ($120-$180 range), and descriptions fitting the HIZE premium minimalist aesthetic",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add hoodies, shorts, sun glasses, caps and etc."
        ]
      },
      "acceptanceCriteria": [
        "At least 2 sunglasses products added to the products array",
        "Each sunglasses product has a unique id, name, price, and description",
        "Prices reflect premium accessories ($120-$180 range)",
        "Descriptions emphasize craftsmanship, UV protection, and timeless design"
      ]
    },
    {
      "id": "REQ-15",
      "text": "Add new product entries to the backend products array in backend/main.mo for caps with realistic names, prices ($35-$55 range), and descriptions fitting the HIZE premium minimalist aesthetic",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add hoodies, shorts, sun glasses, caps and etc."
        ]
      },
      "acceptanceCriteria": [
        "At least 2 cap products added to the products array",
        "Each cap has a unique id, name, price, and description",
        "Prices reflect premium accessories ($35-$55 range)",
        "Descriptions emphasize quality materials, adjustable fit, and clean branding"
      ]
    },
    {
      "id": "REQ-16",
      "text": "Add at least 3 additional diverse product entries to the backend products array in backend/main.mo such as jackets, sweaters, scarves, or bags with realistic names, appropriate pricing, and descriptions fitting the HIZE premium minimalist aesthetic",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add hoodies, shorts, sun glasses, caps and etc."
        ]
      },
      "acceptanceCriteria": [
        "At least 3 additional products from diverse categories added",
        "Each product has a unique id, name, price, and description",
        "Prices are appropriate for the product category and premium positioning",
        "Product selection complements existing catalog and expands wardrobe coverage"
      ]
    },
    {
      "id": "REQ-17",
      "text": "Update frontend/src/components/ProductGrid.tsx to add image URL mappings for all newly added products (hoodies, shorts, sunglasses, caps, and additional items) using the existing imageMap pattern with placeholder image URLs",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add hoodies, shorts, sun glasses, caps and etc."
        ]
      },
      "acceptanceCriteria": [
        "All new product names are mapped to image URLs in the imageMap object",
        "Placeholder image URLs follow the existing pattern (e.g., https://images.unsplash.com/...)",
        "Images are appropriate for each product category",
        "All new products display correctly in the product grid with their images"
      ]
    }
  ],
  "constraints": [
    "Maintain the existing Product type structure with id, name, price, and description fields",
    "Do not modify the ProductGrid component's grid structure or styling",
    "Keep all product names, prices, and descriptions consistent with HIZE's premium minimalist brand identity",
    "Preserve the existing hardcoded products array pattern in backend/main.mo"
  ],
  "nonGoals": [
    "Implementing product categories or filtering functionality",
    "Adding product detail pages",
    "Replacing placeholder images with actual product photography",
    "Implementing inventory management or stock tracking",
    "Adding product variants (sizes, colors)"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}